// !============= модуль 2 ========

// ? № 1
// Використовуючи конструкцію if..else та prompt, напиши код,
//     який питатиме: "Яка офіційна назва JavaScript?".
//     Якщо користувач вводить ECMAScript, то показуй alert з рядком "Правильно!",
//     в іншому випадку - "Не знаєте? ECMAScript!"

// const askQustion = prompt(`Яка офіційна назва JavaScript?`);
// if (typeof askQustion !== `string` || askQustion === "") {
//   console.log("введіть щось");
// } else {
//   askQustion.toLowerCase() === "ecmascript"
//     ? console.log(`Правильно!`)
//     : console.log(`Не знаєте? ECMAScript!`);
// }

// ? № 2
// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка
// формату "14 г. 26 хв.".Якщо значення змінної minutes дорівнює 0,
//     то виводь рядок "14 г.", без хвилин.
// const hours = 14;
// const minutes = 0;

// let messageMinutes;
// minutes === 0 ? (messageMinutes = ``) : (messageMinutes = `${minutes} хв.`);
// console.log(`${hours} г. ${messageMinutes}`);

// ? № 3
// Напиши скрипт, який виводить у консоль рядок "Це позитивне число",
//     якщо у prompt користувач ввів число більше нуля.Якщо було введено нуль,
//     виводь в консоль рядок "Це нуль".Якщо передали від'ємне число,
//         у консолі повинен бути рядок "Це негативне число".

// const userInput = prompt("Введіть число");
// if (userInput !== `0` && !Number(userInput)) {
//   console.log(`введіть число`);
// } else {
//   if (userInput > 0) {
//     console.log(`Це позитивне число`);
//   } else if (userInput === `0`) {
//     console.log(`Це нуль`);
//   } else console.log(`Це негативне число`);
// }

// ? № 4
// Напиши скрипт, який порівнює числа у змінних a та b.
// Якщо обидва значення більше 100, то виведи в консоль максимальне з них.
// В протилежному випадку у консолі повинна бути сума значення b та числа 512.

// const a = 120;
// const b = 110;

// if (a > 100 && b > 100) {
//   a > b ? console.log(a) : console.log(b);
// } else console.log(b + 512);

// ? № 5
// Example 5 - Форматування посилання (endsWith)
// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай до кінця значення link цей символ.Використовуй конструкцію if...else.

let link = "https://my-site.com/about";
// Пиши код нижче за цей рядок

// Пиши код вище за цей рядок
console.log(link);
