// !============= модуль 2 ========

// ? № 1
// Використовуючи конструкцію if..else та prompt, напиши код,
//     який питатиме: "Яка офіційна назва JavaScript?".
//     Якщо користувач вводить ECMAScript, то показуй alert з рядком "Правильно!",
//     в іншому випадку - "Не знаєте? ECMAScript!"

// const askQustion = prompt(`Яка офіційна назва JavaScript?`);
// if (typeof askQustion !== `string` || askQustion === "") {
//   console.log("введіть щось");
// } else {
//   askQustion.toLowerCase() === "ecmascript"
//     ? console.log(`Правильно!`)
//     : console.log(`Не знаєте? ECMAScript!`);
// }

// ? № 2
// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка
// формату "14 г. 26 хв.".Якщо значення змінної minutes дорівнює 0,
//     то виводь рядок "14 г.", без хвилин.
// const hours = 14;
// const minutes = 0;

// let messageMinutes;
// minutes === 0 ? (messageMinutes = ``) : (messageMinutes = `${minutes} хв.`);
// console.log(`${hours} г. ${messageMinutes}`);

// ? № 3
// Напиши скрипт, який виводить у консоль рядок "Це позитивне число",
//     якщо у prompt користувач ввів число більше нуля.Якщо було введено нуль,
//     виводь в консоль рядок "Це нуль".Якщо передали від'ємне число,
//         у консолі повинен бути рядок "Це негативне число".

// const userInput = prompt("Введіть число");
// if (userInput !== `0` && !Number(userInput)) {
//   console.log(`введіть число`);
// } else {
//   if (userInput > 0) {
//     console.log(`Це позитивне число`);
//   } else if (userInput === `0`) {
//     console.log(`Це нуль`);
//   } else console.log(`Це негативне число`);
// }

// ? № 4
// Напиши скрипт, який порівнює числа у змінних a та b.
// Якщо обидва значення більше 100, то виведи в консоль максимальне з них.
// В протилежному випадку у консолі повинна бути сума значення b та числа 512.

// const a = 120;
// const b = 110;

// if (a > 100 && b > 100) {
//   a > b ? console.log(a) : console.log(b);
// } else console.log(b + 512);

// ? № 5
// Example 5 - Форматування посилання (endsWith)
// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай до кінця значення link цей символ.Використовуй конструкцію if...else.

// let link = "https://my-site.com/about";
// // Пиши код нижче за цей рядок
// if (!link.endsWith(`/`)) link += `/`;
// // Пиши код вище за цей рядок
// console.log(link);

// ? № 6
// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
//  Якщо ні, додай до кінця значення link цей символ, але тільки в тому випадку,
//     якщо в link є підрядок "my-site".Використовуй конструкцію if...else.

// let link = "https://somy-site.com/about";
// // Пиши код нижче за цей рядок
// if (!link.endsWith(`/`) && link.includes(`my-site`)) link += `/`;
// // Пиши код вище за цей рядок
// console.log(link);

// ? № 8
// Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.
// Якщо значення змінної hours:
// менше 17, виводь рядок "Pending"
// більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
// більше 24 , виводь рядок "Overdue"

// const hours = 17;
// if (hours < 17) console.log("Pending");
// else if (hours >= 17 && hours <= 24) console.log("Expires");
// else console.log("Overdue");

// ? № 9 + 10
// Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй конструкцію if...else.

// Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
// Якщо до дедлайну 1 день - виведи рядок "Завтра"
// Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
// Якщо до дедлайну 3 + днів - виведи рядок "Дата у майбутньому"

// const daysUntilDeadline = 2;
// // Пиши код нижче за цей рядок
// switch (daysUntilDeadline) {
//   case 0:
//     console.log(`Сьогодні`);
//     break;
//   case 1:
//     console.log("Завтра");
//     break;
//   case 2:
//     console.log("Післязавтра");
//     break;
//   default:
//     console.log("Дата у майбутньому");
// }

// ? № 11
// Напиши цикл for, який виводить у консоль браузера числа за зростанням від min до max,
//     але тільки якщо число кратне 5.

// const max = 100;
// const min = 20;

// for (let i = min; i <= 100; i += 1) if (i % 5 === 0) console.log(i);

// ? № 12
// Напиши скрипт, який питатиме логін за допомогою prompt та логувати результат у консоль браузера.

// Якщо відвідувач вводить "Адмін", то prompt запитує пароль
// Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Я вас не знаю"
// Пароль перевіряти так:

// Якщо введено пароль "Я адмін", то вивести рядок "Здрастуйте!"
// Інакше виводити рядок "Невірний пароль"

// const login = prompt(`логін: `);
// if (login === `Адмін`) {
//   const pass = prompt(`пароль: `);
//   pass === `Я адмін`
//     ? console.log(`Здрастуйте`)
//     : console.log(`Невірний пароль`);
// } else if (typeof login !== `string` || login === "") {
//   console.log(`Скасовано`);
// } else console.log("Я вас не знаю");
